app/Controllers/League.php

    public function index()
    {
        $leagueDB =  new \App\Models\League();

        $find = $leagueDB->findAll();
---
SELECT *
FROM `league`