app/Controllers/Team.php

SELECT *
FROM `team`
---
    public function index()
    {
        $teamDB =  new \App\Models\Team();

        $find = $teamDB->findAll();