app/Controllers/TeamPlayer.php

SELECT *
FROM `team`
WHERE `team`.`id` = '2'
SELECT `team_player`.`id` as `id`, `team_player`.`team_id` as `team_id`, `team_player`.`player_id` as `player_id`, `number`, `position`, `name`, `nationality`
FROM `player`
JOIN `team_player` ON `team_player`.`player_id` = `player`.`id`
WHERE `team_player`.`team_id` = 2
---
    public function index($id)
    {
        $teamDB =  new \App\Models\Team();
        $detail = $teamDB->find($id);

        // get player in team
        $db = \Config\Database::connect();
        $builder = $db->table('player');
        $builder->select('team_player.id as id, team_player.team_id as team_id, team_player.player_id as player_id, number, position, name, nationality');
        $builder->join('team_player', 'team_player.player_id = player.id');
        $builder->where('team_player.team_id = '.$id);
        $players = $builder->get()->getResultArray();

SELECT *
FROM `team`
WHERE `team`.`id` = '1'
SELECT *
FROM `player`
---
    public function add($team_id)
    {
        $teamDB =  new \App\Models\Team();
        $detail = $teamDB->find($team_id);

        $playerDB =  new \App\Models\Player();
        $players = $playerDB->findAll();